Documents/ЗаявкаНаПроведениеРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗаявкаНаПроведениеРемонта</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаявокНаПроведенияРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаявокНаПроведениеРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУдобноеДляЗаказчика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяФактическогоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийПоВыполнениюЗаявки</Name>
					<Comment>Комментарий по выполнению заявки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаПроведениеРемонта</Name>
					<Comment>Ответственный за проведение ремонта (мастер)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценкаПроведенияРемонта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОценокПроведенияРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтатусовЗаявкиНаПроведениеРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийЗаявокНаПроведениеРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаявокНаПроведениеРемонта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроведениеРаботПоЗданию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроведениеРаботПоЛицевомуСчету</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСтатусовЗаявкиНаПроведениеРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыСтатусовЗаявкиНаПроведениеРемонта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НоваяЗаявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принята</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЗаявокНаПроведенияРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокНаПроведенияРемонта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аварийная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыЦенНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отпускная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аварийная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закупочная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаПроведениеРемонта/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийЗаявокНаПроведениеРемонта.ПроведениеРаботПоЛицевомуСчету Тогда
		Элементы.ЛицевойСчет.Видимость = Истина;
		Элементы.Заказчик.Видимость = Истина;
		Элементы.Телефон.Видимость = Истина;
		Элементы.Адрес.Видимость = Истина;
		Элементы.ВремяУдобноеДляЗаказчика.Видимость = Истина;
		Элементы.ВремяУдобноеДляЗаказчика1.Видимость = Истина;
	Иначе
		Элементы.ЛицевойСчет.Видимость = Ложь;
		Элементы.Заказчик.Видимость = Ложь;
		Элементы.Телефон.Видимость = Ложь;
		Элементы.Адрес.Видимость = Ложь;
		Элементы.ВремяУдобноеДляЗаказчика.Видимость = Ложь;
		Элементы.ВремяУдобноеДляЗаказчика1.Видимость = Ложь;
	КонецЕсли;
	
	Статус = ПолучитьСписокСтатусов();
	
	Если Объект.СтатусЗаявки = Статус.Принята Тогда
		
		Элементы.ГруппаВыполнение.Видимость = Истина;
		Элементы.ГруппаНарядЗаказ.Видимость = Истина;
		
	ИначеЕсли Объект.СтатусЗаявки = Статус.Выполнена Тогда

		Элементы.ГруппаВыполнение.Видимость = Истина;
		Элементы.ГруппаНарядЗаказ.Видимость = Истина;
		Элементы.СтатусЗаявки.ТолькоПросмотр = Истина;
		
	ИначеЕсли Объект.СтатусЗаявки = Статус.Отменена Тогда
	
		Элементы.Комментарий.Заголовок = "Текст заявки и причина отмены";
        Элементы.СтатусЗаявки.ТолькоПросмотр = Истина;
		
	ИначеЕсли НЕ Объект.Ссылка.Пустая() Тогда
		
		Элементы.ГруппаВыполнение.Видимость = Ложь;
		Элементы.ГруппаНарядЗаказ.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаВыполнение.Видимость = Ложь;
		Элементы.ГруппаНарядЗаказ.Видимость = Ложь;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) И ЗначениеЗаполнено(Объект.Заказчик) Тогда
	
		 Элементы.Заказчик.ТолькоПросмотр = Истина;
	
	КонецЕсли;

КонецПроцедуры // УстановитьВидимостьИДоступность()

// Процедура - обработчик события ПриИзменении поля ввода ВидОперации.
//
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();

КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода ЛицевойСчет.
//
&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыВыбораЗначения.Вставить("ОтборЗдание",			Объект.Здание);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
	
КонецПроцедуры

// Функция возвращает данные о лицевом счете.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеЛицевойСчетПриИзменении(ЛицевойСчет)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить("Организация", ЛицевойСчет.Владелец.Организация);
	СтруктураДанные.Вставить("Здание", ЛицевойСчет.Владелец);
	СтруктураДанные.Вставить("Адрес", СокрЛП(ЛицевойСчет.Владелец.Наименование) + " " +СокрЛП(ЛицевойСчет.ОбъектЛицевогоСчета.Наименование));
	СтруктураДанные.Вставить("Телефон", ЛицевойСчет.Телефон);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец
		|ИЗ
		|	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|ГДЕ
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет = &ЛицевойСчет";

	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		 СтруктураДанные.Вставить("ВладелецСчета", Выборка.ОтветственныйВладелец);
	КонецЦикла;

	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеЛицевойСчетПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода ЛицевойСчет.
//
&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)	
	
	СтруктураДанные = ПолучитьДанныеЛицевойСчетПриИзменении(Объект.ЛицевойСчет);
	
	Объект.Организация = СтруктураДанные.Организация;
	Объект.Здание = СтруктураДанные.Здание;
	Объект.Адрес = СтруктураДанные.Адрес;
	Объект.Телефон = СтруктураДанные.Телефон;
	Объект.Заказчик = СтруктураДанные.ВладелецСчета;
	
	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) И ЗначениеЗаполнено(Объект.Заказчик) Тогда
	
		 Элементы.Заказчик.ТолькоПросмотр = Истина;
	
	КонецЕсли;
	 
КонецПроцедуры

// Функция возвращает список статусов.
//
&НаСервере
Функция ПолучитьСписокСтатусов()
	
	Статусы = Новый Структура;
	
	Статусы.Вставить("НоваяЗаявка", Перечисления.ВидыСтатусовЗаявкиНаПроведениеРемонта.НоваяЗаявка);
	Статусы.Вставить("Принята", Перечисления.ВидыСтатусовЗаявкиНаПроведениеРемонта.Принята);
	Статусы.Вставить("Выполнена", Перечисления.ВидыСтатусовЗаявкиНаПроведениеРемонта.Выполнена);
	Статусы.Вставить("Отменена", Перечисления.ВидыСтатусовЗаявкиНаПроведениеРемонта.Отменена);
	
	Возврат Статусы;
	
КонецФункции

// Функция цену номенклатуры.
//
&НаСервере
Функция ПолучитьЦенуНаСервере(Номенклатура)
	
	Если Объект.ВидЗаявки = Перечисления.ВидыЗаявокНаПроведенияРемонта.Аварийная Тогда		
		ТипЦены = Перечисления.ТипыЦенНоменклатуры.Аварийная;
	Иначе
		ТипЦены = Перечисления.ТипыЦенНоменклатуры.Отпускная;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
		|	И ЦеныНоменклатурыСрезПоследних.ТипЦены = &ТипЦены";

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТипЦены", ТипЦены);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Цена;
	КонецЦикла;

КонецФункции

// Процедура рассчитывает сумму в строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСумму(СтрокаТабличнойЧасти)
	
	СтрокаТабличнойЧасти.СуммаПлан = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.КоличествоПлан;
	СтрокаТабличнойЧасти.СуммаФакт = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.КоличествоФакт;
	
	РассчитатьОбщуюСумму();
	
КонецПроцедуры

// Процедура рассчитывает общую сумму.
//
&НаКлиенте
Процедура РассчитатьОбщуюСумму()
	
	Объект.СуммаДокумента = Объект.Работы.Итог("СуммаФакт") + Объект.Запасы.Итог("СуммаФакт");
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода СтатусЗаявки.
//
&НаКлиенте
Процедура СтатусЗаявкиПриИзменении(Элемент)
	
	Статус = ПолучитьСписокСтатусов();
	
	Если Объект.СтатусЗаявки = Статус.Отменена Тогда
	
		Элементы.Комментарий.Заголовок = "Текст заявки и причина отмены";
				
	Иначе
		
		Элементы.Комментарий.Заголовок = "Текст заявки";

	КонецЕсли;
	
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
    ИнфоПоЛицевомуСчету = "Информация по лицевому счету";
	
	УстановитьВидимостьИДоступность();
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Статус = ПолучитьСписокСтатусов();
	
	Если Объект.СтатусЗаявки = Статус.НоваяЗаявка И Элементы.Работы.ТекущиеДанные <> Неопределено Тогда
		Ответ = Вопрос(НСтр("ru='Хотите присвоить заявке статус ""Принята""?';uk='Прагнете привласнити заявці статус ""Прийнята""?'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СтатусЗаявки = Статус.Принята;
		КонецЕсли; 
	КонецЕсли;
	
	Если Объект.СтатусЗаявки = Статус.Принята И (ЗначениеЗаполнено(Объект.ОценкаПроведенияРемонта) ИЛИ ЗначениеЗаполнено(Объект.ВремяФактическогоВыполнения)) Тогда
		Ответ = Вопрос(НСтр("ru='Хотите присвоить заявке статус ""Выполнена""?';uk='Прагнете привласнити заявці статус ""Виконана""?'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СтатусЗаявки = Статус.Выполнена;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОЙ ЧАСТИ ЗАПАСЫ

// Процедура - обработчик события ПриИзменении табличной части "Запасы".
//
&НаКлиенте
Процедура ЗапасыПриИзменении(Элемент)
	
    РассчитатьОбщуюСумму();

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Номенклатура.
//
&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Цена) Тогда
	
		ТекущиеДанные.Цена = ПолучитьЦенуНаСервере(ТекущиеДанные.Номенклатура);
        РассчитатьСумму(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Цена.
//
&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	
	РассчитатьСумму(ТекущиеДанные);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода КоличествоПлан.
//
&НаКлиенте
Процедура ЗапасыКоличествоПланПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	
	РассчитатьСумму(ТекущиеДанные);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода КоличествоФакт.
//
&НаКлиенте
Процедура ЗапасыКоличествоФактПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.СуммаФакт = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.КоличествоФакт;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОЙ ЧАСТИ РАБОТЫ

// Процедура - обработчик события ПриИзменении табличной части "Работы".
//
&НаКлиенте
Процедура РаботыПриИзменении(Элемент)
	
	РассчитатьОбщуюСумму();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ВидРабот.
//
&НаКлиенте
Процедура РаботыВидРаботПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Цена) Тогда
	
		ТекущиеДанные.Цена = ПолучитьЦенуНаСервере(ТекущиеДанные.ВидРабот);
        РассчитатьСумму(ТекущиеДанные);
		
	КонецЕсли;
		
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Цена.
//
&НаКлиенте
Процедура РаботыРасценкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	
	РассчитатьСумму(ТекущиеДанные);

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ВремяПлан.
//
&НаКлиенте
Процедура РаботыВремяПланПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	
	РассчитатьСумму(ТекущиеДанные);

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ВремяФакт.
//
&НаКлиенте
Процедура РаботыВремяФактПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	
	РассчитатьСумму(ТекущиеДанные);

КонецПроцедуры
